In [3]:
import numpy as np
import pandas as pd

In [7]:
frame = pd.DataFrame([[1,6.5,None],[1,None,None],
                     [None,None,None],[6.5,3,None]])
cleaned = frame.dropna()

frame

     0    1     2
0  1.0  6.5  None
1  1.0  NaN  None
2  NaN  NaN  None
3  6.5  3.0  None

In [8]:
cleaned

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [11]:
data_1 = frame.dropna(how='all',axis=0)#丢弃全为空值的行
data_1

     0    1     2
0  1.0  6.5  None
1  1.0  NaN  None
3  6.5  3.0  None

In [12]:
data_2 = frame.dropna(how='all',axis=1)#丢弃全为空值的列
data_2

     0    1
0  1.0  6.5
1  1.0  NaN
2  NaN  NaN
3  6.5  3.0

In [13]:
data_3  = frame.dropna(thresh=2)
data_3

     0    1     2
0  1.0  6.5  None
3  6.5  3.0  None

In [14]:
# 填充缺失值
frame.fillna(0)

     0    1  2
0  1.0  6.5  0
1  1.0  0.0  0
2  0.0  0.0  0
3  6.5  3.0  0

In [15]:
frame.fillna({0:0,1:1,2:2})

     0    1  2
0  1.0  6.5  2
1  1.0  1.0  2
2  0.0  1.0  2
3  6.5  3.0  2

In [16]:
frame = pd.DataFrame({
    'C1':['one','two']*2+['two'],
    'C2':[1,1,2,3,3]
})

frame

    C1  C2
0  one   1
1  two   1
2  one   2
3  two   3
4  two   3

In [17]:
frame.drop_duplicates(['C1'])

    C1  C2
0  one   1
1  two   1

In [18]:
frame = pd.DataFrame({
    'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
    'ounces':[4,3,12,6,7.5,8,3,5,6]
})
frame

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [19]:
meat2animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [20]:
frame['animal']=frame.loc[:,'food'].str.lower().map(meat2animal)
frame

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [21]:
obj = pd.Series([1,-999,2,3,4,-999])
obj.replace([-999],[None])

0       1
1    None
2       2
3       3
4       4
5    None
dtype: object

In [22]:
replace_map={-999:None}
obj.replace(replace_map)

0       1
1    None
2       2
3       3
4       4
5    None
dtype: object

In [23]:
# 行列标签的更改
frame = pd.DataFrame(
     np.arange(12).reshape((3,4)) ,
    index=['Ohio','Colorado','New York'],
    columns = ['one','two','three','four']
)
frame

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [24]:
index_trans = lambda x:x[:4].upper()
frame.index.map(index_trans)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [25]:
frame.rename(
    index={'Ohio':'Indiana'},
    columns ={'three':'peekaboo'},
    inplace = True
)
frame

          one  two  peekaboo  four
Indiana     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [26]:
# 数据离散化
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]#五个分割点将数据分成4个区间
group_names=['Youth','YoungAdult','MiddleAged','Senior']
cats = pd.cut(ages,bins,labels=group_names)
cats.value_counts()

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [27]:
data = np.random.randn(20)
cats = pd.cut(data,4)#将区间平均分成4个子区间
cats.value_counts()

(-1.716, -1.034]    3
(-1.034, -0.354]    7
(-0.354, 0.326]     5
(0.326, 1.006]      5
dtype: int64

In [28]:
data = np.random.randn(100)
cats = pd.qcut(data,[0,0.1,0.5,0.9,1])#指定百分位数
cats.value_counts()

(-2.066, -0.992]    10
(-0.992, 0.0373]    40
(0.0373, 1.491]     40
(1.491, 2.868]      10
dtype: int64

In [31]:
data = np.random.randn(100)
cats = pd.qcut(data,4)#指定子区间数
cats.value_counts()

(-1.9949999999999999, -0.513]    25
(-0.513, 0.118]                  25
(0.118, 0.878]                   25
(0.878, 2.765]                   25
dtype: int64

In [34]:
data = pd.DataFrame(np.random.randn(1000,3))
data.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean     -0.009494     0.027887    -0.009274
std       1.008726     1.033777     0.996284
min      -3.756462    -3.225210    -3.140718
25%      -0.700642    -0.685414    -0.691709
50%      -0.042453     0.049546    -0.019690
75%       0.664496     0.716057     0.648016
max       2.565888     2.990048     3.393412

In [35]:
# 将异常值截断为-3或3：
data[(np.abs(data)>3)]=np.sign(data)*3
data.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean     -0.008666     0.028112    -0.009527
std       1.005978     1.033092     0.994582
min      -3.000000    -3.000000    -3.000000
25%      -0.700642    -0.685414    -0.691709
50%      -0.042453     0.049546    -0.019690
75%       0.664496     0.716057     0.648016
max       2.565888     2.990048     3.000000

In [40]:
# 数据重排与随机采样
frame = pd.DataFrame(np.arange(20).reshape((5,4)))
# re_order = np.random.permutation(frame.shape[0])

# training_set = frame.iloc[re_order[:3],:]
# test_set = frame.iloc[re_order[3:],:]
# mini_batch = training_set.sample(1,replace=True)

In [42]:
frame

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [50]:
training_set = frame.iloc[0:3]
print(training_set)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [51]:
frame = pd.DataFrame({
       'key':['b','b','a','c']
})
dummies = pd.get_dummies(frame.loc[:'key'],prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1